Repository: taikun114/Mocolamma
Catalog: Mocolamma/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, ru, uk, zh_hans, zh_hk

source: Are you sure you want to open the PayPal.Me page?
ar: هل أنت متأكد أنك تريد فتح صفحة PayPal.Me؟
de: Möchten Sie die PayPal.Me Seite wirklich öffnen?
es: ¿Seguro que quieres abrir la página de PayPal.Me?
fr: Voulez-vous vraiment ouvrir la page PayPal.Me ?
ja: PayPal.Meのページを開いてもよろしいですか？
ko: PayPal.Me 페이지를 여시겠습니까?
ru: Вы уверены, что хотите открыть страницу PayPal.Me?
uk: Ви впевнені, що хочете відкрити сторінку PayPal.Me?
zh_hans: 您确定要打开 PayPal.Me 页面吗？
zh_hk: 您確定要開啟 PayPal.Me 頁面嗎？

source: Are you sure you want to open the Qwen Code GitHub page?
ar: هل أنت متأكد أنك تريد فتح صفحة GitHub لـ Qwen Code؟
de: Möchten Sie die Qwen Code GitHub Seite wirklich öffnen?
es: ¿Seguro que quieres abrir la página de GitHub de Qwen Code?
fr: Voulez-vous vraiment ouvrir la page GitHub de Qwen Code ?
ja: Qwen CodeのGitHubページを開いてもよろしいですか？
ko: Qwen Code GitHub 페이지를 여시겠습니까?
ru: Вы уверены, что хотите открыть страницу Qwen Code на GitHub?
uk: Ви впевнені, що хочете відкрити сторінку Qwen Code на GitHub?
zh_hans: 您确定要打开 Qwen Code 的 GitHub 页面吗？
zh_hk: 您確定要開啟 Qwen Code 的 GitHub 頁面嗎？

source: Are you sure you want to open the send feedback email window?
ar: هل أنت متأكد أنك تريد فتح نافذة إرسال بريد إلكتروني للملاحظات؟
de: Möchten Sie das Fenster zum Senden einer Feedback-E-Mail wirklich öffnen?
es: ¿Seguro que quieres abrir la ventana de envío de correo electrónico de comentarios?
fr: Voulez-vous vraiment ouvrir la fenêtre d'envoi d'e-mail de commentaires ?
ja: フィードバックのメール送信画面を開いてもよろしいですか？
ko: 피드백 이메일 작성 창을 여시겠습니까?
ru: Вы уверены, что хотите открыть окно отправки отзыва по электронной почте?
uk: Ви впевнені, що хочете відкрити вікно надсилання відгуку електронною поштою?
zh_hans: 您确定要打开发送反馈邮件的窗口吗？
zh_hk: 您確定要開啟發送回饋郵件的視窗吗？

source: Are you sure you want to open the Textual GitHub page?
ar: هل أنت متأكد أنك تريد فتح صفحة GitHub لـ Textual？
de: Möchten Sie die Textual GitHub Seite wirklich öffnen?
es: ¿Seguro que quieres abrir la página de GitHub de Textual?
fr: Voulez-vous vraiment ouvrir la page GitHub de Textual ?
ja: TextualのGitHubページを開いてもよろしいですか？
ko: Textual GitHub 페이지를 여시겠습니까?
ru: Вы уверены, что хотите открыть страницу Textual на GitHub?
uk: Ви впевнені, що хочете відкрити сторінку Textual на GitHub?
zh_hans: 您确定要打开 Textual 的 GitHub 页面吗？
zh_hk: 您確定要開啟 Textual 的 GitHub 頁面嗎？

source: Are you sure you want to open the UniversalSFSymbolsPicker GitHub page?
ar: هل أنت متأكد أنك تريد فتح صفحة GitHub لـ UniversalSFSymbolsPicker؟
de: Möchten Sie die UniversalSFSymbolsPicker GitHub Seite wirklich öffnen?
es: ¿Seguro que quieres abrir la página de GitHub de UniversalSFSymbolsPicker?
fr: Voulez-vous vraiment ouvrir la page GitHub de UniversalSFSymbolsPicker ?
ja: UniversalSFSymbolsPickerのGitHubページを開いてもよろしいですか？
ko: UniversalSFSymbolsPicker GitHub 페이지를 여시겠습니까?
ru: Вы уверены, что хотите открыть страницу UniversalSFSymbolsPicker на GitHub?
uk: Ви впевнені, що хочете відкрити сторінку UniversalSFSymbolsPicker на GitHub?
zh_hans: 您确定要打开 UniversalSFSymbolsPicker 的 GitHub 页面吗？
zh_hk: 您確定要開啟 UniversalSFSymbolsPicker 的 GitHub 頁面嗎？

source: Ascending
ar: تصاعدي
de: Aufsteigend
es: Ascendente
fr: Croissant
ja: 昇順
ko: 오름차순
ru: По возрастанию
uk: За зростанням
zh_hans: 升序
zh_hk: 升序

source: Ask questions and share your opinions
ar: اطرح الأسئلة وشارك آراءك
de: Stellen Sie Fragen und teilen Sie Ihre Meinungen mit
es: Haz preguntas y comparte tus opiniones
fr: Posez des questions et partagez vos opinions
ja: 質問や意見交換などを行いましょう
ko: 질문하고 의견을 나누세요
ru: Задавайте вопросы и делитесь мнениями
uk: Задавайте питання та діліться думками
zh_hans: 提问并分享您的意见
zh_hk: 提問並分享您的意見

source: Assistant message
ar: رسالة المساعد
de: Nachricht des Assistenten
es: Mensaje del asistente
fr: Message de l'assistant
ja: アシスタントのメッセージ
ko: 어시스턴트 메시지
ru: Сообщение ассистента
uk: Повідомлення асистента
zh_hans: 助手消息
zh_hk: 助手訊息

source: Attach Images
ar: إرفاق صور
de: Bilder anhängen
es: Adjuntar imágenes
fr: Joindre des images
ja: 画像を添付
ko: 이미지 첨부
ru: Прикрепить изображения
uk: Прикріпити зображення
zh_hans: 附加图像
zh_hk: 附加圖像

source: Audio
ar: صوت
ja: オーディオ
ko: 오디오
ru: Аудио
uk: Аудіо
zh_hans: 音频
zh_hk: 音訊

source: Buy Green Tea
ar: اشترِ لي شاي أخضر
de: Grünen Tee kaufen
es: Comprar Té Verde
fr: Offrir un thé vert
ja: 緑茶を奢る
ko: 녹차 한 잔 후원하기
ru: Угостить зеленым чаем
uk: Пригостити зеленим чаєм
zh_hans: 请喝绿茶
zh_hk: 請喝綠茶

source: Buy Me Green Tea
ar: اشترِ لي شاي أخضر
de: Kaufen Sie mir einen grünen Tee
es: Cómprame un Té Verde
fr: Offrez-moi un thé vert
ja: 緑茶を買ってあげる
ko: 녹차 한 잔 후원하기
ru: Купить мне зеленый чай
uk: Купити мені зелений чай
zh_hans: 请我喝绿茶
zh_hk: 請我喝綠茶

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
ru: Отмена
uk: Скасувати
zh_hans: 取消
zh_hk: 取消

source: Cancel editing.
ar: إلغاء التعديل.
de: Bearbeitung abbrechen.
es: Cancelar edición.
fr: Annuler la modification.
ja: 編集をキャンセルする
ko: 편집 취소.
ru: Отменить редактирование.
uk: Скасувати редагування.
zh_hans: 取消编辑。
zh_hk: 取消編輯。

source: Chat
ar: دردشة
ja: チャット
ko: 채팅
ru: Чат
uk: Чат
zh_hans: 聊天
zh_hk: 聊天

source: Chat Settings
ar: إعدادات الدردشة
de: Chat-Einstellungen
es: Configuración de Chat
fr: Paramètres du chat
ja: チャット設定
ko: 채팅 설정
ru: Настройки чата
uk: Налаштування чату
zh_hans: 聊天设置
zh_hk: 聊天設定

source: Checking connection...
ar: جارٍ التحقق من الاتصال...
de: Verbindung wird geprüft...
es: Comprobando la conexión...
fr: Vérification de la connexion...
ja: 接続を確認中...
ko: 연결 확인 중...
ru: Проверка соединения...
uk: Перевірка з'єднання...
zh_hans: 正在检查连接...
zh_hk: 正在檢查連線...

source: Checking...
ar: جاري التحقق...
de: Wird überprüft...
es: Comprobando...
fr: Vérification…
ja: 確認中…
ko: 확인 중…
ru: Проверка...
uk: Перевірка...
zh_hans: 检查中…
zh_hk: 檢查中…

source: Choose Files...
ar: اختر ملفات...
de: Dateien auswählen...
es: Elegir archivos...
fr: Choisir des fichiers...
ja: ファイルを選択...
ko: 파일 선택...
ru: Выбрать файлы...
uk: Вибрати файли...
zh_hans: 选择文件...
zh_hk: 選擇檔案...

source: Clear Chat History
ar: مسح سجل الدردشة
de: Chat-Verlauf löschen
es: Borrar historial de chat
fr: Effacer l'historique
ja: チャット履歴を消去
ko: 채팅 기록 삭제
ru: Очистить историю чата
uk: Очистити історію чату
zh_hans: 清除聊天记录
zh_hk: 清除聊天記錄

source: Clear History
ar: مسح السجل
de: Verlauf löschen
es: Borrar historial
fr: Effacer l'historique
ja: 履歴を消去
ko: 기록 삭제
ru: Очистить историю
uk: Очистити історію
zh_hans: 清除历史记录
zh_hk: 清除歷史記錄

source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
ru: Закрыть
uk: Закрити
zh_hans: 关闭
zh_hk: 關閉

source: Code
ar: كود
es: Código
ja: コード
ko: 코드
ru: Код
uk: Код
zh_hans: 代码
zh_hk: 程式碼

source: Collapse thinking process
ar: طي عملية التفكير
de: Denkprozess einklappen
es: Contraer proceso de pensamiento
fr: Réduire le processus de réflexion
ja: 思考プロセスを折りたたむ
ko: 사고 과정 접기
ru: Свернуть процесс размышления
uk: Згорнути процес роздумів
zh_hans: 折叠思考过程
zh_hk: 折疊思考過程

source: Community
ar: مجتمع
es: Comunidad
fr: Communauté
ja: コミュニティ
ko: 커뮤니티
ru: Сообщество
uk: Спільнота
zh_hans: 社区
zh_hk: 社區

source: Complete editing and retry.
ar: إكمال التعديل وإعادة المحاولة.
de: Bearbeitung abschließen und erneut versuchen.
es: Completar edición y reintentar.
fr: Terminer la modification et réessayer.
ja: 編集を完了してやり直します。
ko: 편집 완료 후 다시 시도.
ru: Завершить редактирование и повторить.
uk: Завершити редагування та повторити.
zh_hans: 完成编辑并重试。
zh_hk: 完成編輯並重試。

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
ja: 完了しました
ko: 완료됨
ru: Завершено
uk: Завершено
zh_hans: 已完成
zh_hk: 已完成

source: Completion
ar: إكمال
de: Vervollständigung
es: Completado
fr: Complétion
ja: コンプリーション
ko: 완성
ru: Завершение
uk: Завершення
zh_hans: 补全
zh_hk: 補全

source: Connected
ar: متصل
de: Verbunden
es: Conectado
fr: Connecté
ja: 接続済み
ko: 연결됨
ru: Подключено
uk: Підключено
zh_hans: 已连接
zh_hk: 已連線

source: Connected successfully.
ar: تم الاتصال بنجاح.
de: Erfolgreich verbunden.
es: Conectado con éxito.
fr: Connecté avec succès.
ja: 正常に接続されました。
ko: 성공적으로 연결되었습니다.
ru: Соединение успешно установлено.
uk: З'єднання успешно встановлено.
zh_hans: 连接成功。
zh_hk: 連線成功。

source: Connecting...
ar: جاري الاتصال...
de: Verbinden...
es: Conectando...
fr: Connexion en cours…
ja: 接続中…
ko: 연결 중…
ru: Подключение...
uk: Підключення...
zh_hans: 正在连接…
zh_hk: 連線中…

source: Connection Failed
ar: فشل الاتصال
de: Verbindung fehlgeschlagen
es: Error de conexión
fr: Échec de la connexion
ja: 接続に失敗しました
ko: 연결 실패
ru: Ошибка подключения
uk: Помилка підключення
zh_hans: 连接失败
zh_hk: 連線失敗

source: Connection failed. Please check if the Ollama server is running.
ar: فشل الاتصال. يرجى التحقق مما إذا كان خادم Ollama قيد التشغيل.
de: Verbindung fehlgeschlagen. Bitte überprüfen Sie, ob der Ollama-Server läuft.
es: Error de conexión. Por favor, compruebe si el servidor Ollama se está ejecutando.
fr: Échec de la connexion. Veuillez vérifier si le serveur Ollama est en cours d'exécution.
ja: サーバーに接続できませんでした。Ollamaサーバーが起動しているか確認してください。
ko: 연결에 실패했습니다. Ollama 서버가 실행 중인지 확인하십시오.
ru: Ошибка подключения. Пожалуйста, проверьте, запущен ли сервер Ollama.
uk: Помилка підключення. Будь ласка, перевірте, чи запущено сервер Ollama.
zh_hans: 连接失败。请检查 Ollama 服务器是否正在运行。
zh_hk: 連線失敗。請檢查 Ollama 伺服器是否正在執行。

source: Connection timed out. The server might be down or the address is incorrect.
ar: انتهت مهلة الاتصال. قد يكون الخادم معطلاً أو العنوان غير صحيح.
de: Zeitüberschreitung der Verbindung. Der Server ist möglicherweise ausgefallen oder die Adresse ist falsch.
es: Tiempo de espera de conexión agotado. Es posible que el servidor esté caído o que la dirección sea incorrecta.
fr: Délai de connexion dépassé. Le serveur est peut-être en panne ou l'adresse est incorrecte.
ja: 接続がタイムアウトしました。サーバーが停止しているか、アドレスが間違っている可能性があります。
ko: 연결 시간이 초과되었습니다. 서버가 다운되었거나 주소가 잘못되었을 수 있습니다.
ru: Время ожидания соединения истекло. Возможно, сервер не работает или адрес указан неверно.
uk: Час очікування з'єднання вичерпано. Можливо, сервер не працює або адреса вказана неправильно.
zh_hans: 连接超时。服务器可能已关闭或地址不正确。
zh_hk: 連線逾時。伺服器可能已關閉或位址不正確。

# ConnectionError.title
source: Connection Error
ar: خطأ في الاتصال
de: Verbindungsfehler
es: Error de Conexión
fr: Erreur de connexion
ja: 接続エラー
ko: 연결 오류
ru: Ошибка подключения
uk: Помилка підключення
zh_hans: 连接错误
zh_hk: 連線錯誤

source: Context Length:
ar: طول السياق:
de: Kontextlänge:
es: Longitud del Contexto:
fr: Longueur du contexte :
ja: コンテキスト長:
ko: 컨텍스트 길이:
ru: Длина контекста:
uk: Довжина контексту:
zh_hans: 上下文长度：
zh_hk: 上下文長度：

source: Context Window
ar: نافذة السياق
de: Kontextfenster
es: Ventana de Contexto
fr: Fenêtre de contexte
ja: コンテキストウィンドウ
ko: 컨텍스트 창
ru: Окно контекста
uk: Вікно контексту
zh_hans: 上下文窗口
zh_hk: 上下文視窗

source: Contributors
ar: المساهمون
de: Mitwirkende
es: Contribuidores
fr: Contributeurs
ja: 貢献者
ko: 기여자
ru: Участники
uk: Учасники
zh_hans: 贡献者
zh_hk: 貢獻者

source: Contributors involved in the development
ar: المساهمون المشاركون في التطوير
de: Am Entwicklungsprozess beteiligte Mitwirkende
es: Contribuidores involucrados en el desarrollo
fr: Contributeurs impliqués dans le développement
ja: 開発に携わった貢献者
ko: 개발에 참여한 기여자들
ru: Участники, участвовавшие в разработке
uk: Учасники, що брали участь у розробці
zh_hans: 参与开发的贡献者
zh_hk: 參與開發的貢獻者

source: Copy
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
ko: 복사
ru: Копировать
uk: Копіювати
zh_hans: 复制
zh_hk: 複製

source: Copy Image
ar: نسخ الصورة
de: Bild kopieren
es: Copiar imagen
fr: Copier l'image
ja: 画像をコピー
ko: 이미지 복사
ru: Копировать изображение
uk: Копіювати зображення
zh_hans: 复制图像
zh_hk: 複製圖片

source: Copy Model Name
ar: نسخ اسم النموذج
de: Modellnamen kopieren
es: Copiar Nombre del Modelo
fr: Copier le nom du modèle
ja: モデル名をコピー
ko: 모델 이름 복사
ru: Копировать название модели
uk: Копіювати назву моделі
zh_hans: 复制模型名称
zh_hk: 複製模型名稱

source: Copyright ©︎ 2026 Taiga Imaura
ar: حقوق الطبع والنشر © 2026 Taiga Imaura
ja: Copyright ©︎ 2026 今浦大雅
zh_hans: Copyright ©︎ 2026 今浦大雅
zh_hk: Copyright ©︎ 2026 今浦大雅

source: Could not connect to the server.
ar: تعذر الاتصال بالخادم.
de: Verbindung zum Server konnte nicht hergestellt werden.
es: No se pudo conectar al servidor.
fr: Impossible de se connecter au serveur.
ja: サーバーに接続できませんでした。
ko: 서버에 연결할 수 없습니다.
ru: Не удалось подключиться к серверу.
uk: Не вдалося підключитися до сервера.
zh_hans: 无法连接到服务器。
zh_hk: 無法連線到伺服器。

source: Could not find the host. Please check the address.
ar: تعذر العثور على المضيف. يرجى التحقق من العنوان.
de: Host konnte nicht gefunden werden. Bitte überprüfen Sie die Adresse.
es: No se pudo encontrar el host. Por favor, compruebe la dirección.
fr: Hôte introuvable. Veuillez vérifier l'adresse.
ja: ホストが見つかりませんでした。アドレスを確認してください。
ko: 호스트를 찾을 수 없습니다. 주소를 확인하세요.
ru: Не удалось найти хост. Пожалуйста, проверьте адрес.
uk: Не вдалося знайти хост. Будь ласка, перевірте адресу.
zh_hans: 找不到主机。请检查地址。
zh_hk: 找不到主機。請檢查地址。

source: Could not load model information.
ar: تعذر تحميل معلومات النموذج.
de: Modellinformationen konnten nicht geladen werden.
es: No se pudo cargar la información del modelo.
fr: Impossible de charger les informations sur le modèle.
ja: モデル情報を読み込めませんでした。
ko: 모델 정보를 불러올 수 없습니다.
ru: Не удалось загрузить информацию о модели.
uk: Не вдалося завантажити інформацію про модель.
zh_hans: 无法加载模型信息。
zh_hk: 無法載入模型資訊。

source: Custom Height
ar: ارتفاع مخصص
de: Benutzerdefinierte Höhe
es: Altura personalizada
fr: Hauteur personnalisée
ja: カスタム高さ
ko: 사용자 지정 높이
ru: Высота
uk: Висота
zh_hans: 自定义高度
zh_hk: 自定義高度

source: Custom Settings
ar: إعدادات مخصصة
de: Benutzerdefinierte Einstellungen
es: Ajustes Personalizados
fr: Paramètres personnalisés
ja: カスタム設定
ko: 사용자 지정 설정
ru: Свои настройки
uk: Свої налаштування
zh_hans: 自定义设置
zh_hk: 自定義設定

source: Custom Steps
ar: خطوات مخصصة
de: Benutzerdefinierte Schritte
es: Pasos personalizados
fr: Étapes personnalisées
ja: カスタムステップ数
ko: 사용자 지정 단계
ru: Шаги
uk: Кроки
zh_hans: 自定义步数
zh_hk: 自定義步數

source: Custom Width
ar: عرض مخصص
de: Benutzerdefinierte Breite
es: Ancho personalizado
fr: Largeur personnalisée
ja: カスタム幅
ko: 사용자 지정 너비
ru: Ширина
uk: Ширина
zh_hans: 自定义宽度
zh_hk: 自定義寬度

source: Custom...
ar: مخصص...
de: Benutzerdefiniert...
es: Personalizado...
fr: Personnalisé...
ja: カスタム...
ko: 사용자 지정...
ru: Настроить...
uk: Налаштувати...
zh_hans: 自定义...
zh_hk: 自定義...

source: Date
ar: التاريخ
de: Datum
es: Fecha
ja: 日付
ko: 날짜
ru: Дата
uk: Дата
zh_hans: 日期
zh_hk: 日期

source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
ru: Удалить
uk: Видалити
zh_hans: 删除
zh_hk: 刪除

# Delete Error: HTTP Status Code %d - %@ on %@
source: Delete Error: HTTP Status Code %1$d - %2$@ on %3$@
ar: خطأ في الحذف: رمز حالة HTTP %1$d - %2$@ على %3$@
de: Löschfehler: HTTP Status Code %1$d - %2$@ auf %3$@
es: Error de eliminación: Código de estado HTTP %1$d - %2$@ en %3$@
fr: Erreur de suppression : Code d'état HTTP %1$d - %2$@ sur %3$@
ja: 削除エラー: HTTPステータスコード %1$d - %2$@（%3$@）
ko: 삭제 오류: HTTP 상태 코드 %1$d - %2$@ (%3$@)
ru: Ошибка удаления: HTTP %1$d - %2$@ на %3$@
uk: Помилка видалення: HTTP %1$d - %2$@ на %3$@
zh_hans: 删除错误：HTTP 状态码 %1$d - %2$@（在 %3$@ 上）
zh_hk: 刪除錯誤：HTTP 狀態碼 %1$d - %2$@（在 %3$@ 上）

# Delete Error: Model '%@' not found (404 Not Found) on %@.
source: Delete Error: Model '%1$@' not found (404 Not Found) on %2$@.
ar: خطأ في الحذف: النموذج '%1' غير موجود (404 غير موجود) على %2.
de: Löschfehler: Modell '%1$@' nicht gefunden (404 Not Found) auf %2$@.
es: Error de eliminación: Modelo '%1$@' no encontrado (404 No Encontrado) en %2$@.
fr: Erreur de suppression : Modèle '%1$@' introuvable (404 Not Found) sur %2$@.
ja: 削除エラー: モデル「%1$@」は%2$@で見つかりませんでした（404 Not Found）。
ko: 삭제 오류: %2에서 모델 '%1'을(를) 찾을 수 없습니다 (404 Not Found).
ru: Ошибка удаления: модель '%1' не найдена (404 Not Found) на %2.
uk: Помилка видалення: модель '%1' не знайдена (404 Not Found) на %2.
zh_hans: 删除错误：在 %2$@ 上未找到模型“%1$@”（404 Not Found）。
zh_hk: 刪除錯誤：在 %2$@ 上找不到模型「%1$@」（404 Not Found）。

source: Delete Error: Unknown response type.
ar: خطأ في الحذف: نوع استجابة غير معروف.
de: Löschfehler: Unbekannter Antworttyp.
es: Error de eliminación: Tipo de respuesta desconocido.
fr: Erreur de suppression : Type de réponse inconnu.
ja: 削除エラー: 不明なレスポンスタイプです。
ko: 삭제 오류: 알 수 없는 응답 유형입니다.
ru: Ошибка удаления: неизвестный тип ответа.
uk: Помилка видалення: невідомий тип відповіді.
zh_hans: 删除错误：响应类型未知。
zh_hk: 刪除錯誤：回應類型未知。

source: Delete Model
ar: حذف النموذج
de: Modell löschen
es: Eliminar Modelo
fr: Supprimer le modèle
ja: モデルを削除
ko: 모델 삭제
ru: Удалить модель
uk: Видалити модель
zh_hans: 删除模型
zh_hk: 刪除模型

source: Delete Server
ar: حذف الخادم
de: Server löschen
es: Eliminar Servidor
fr: Supprimer le serveur
ja: サーバーを削除
ko: 서버 삭제
ru: Удалить сервер
uk: Видалити сервер
zh_hans: 删除服务器
zh_hk: 刪除伺服器

source: Delete...
ar: حذف…
de: Löschen...
es: Eliminar...
fr: Supprimer...
ja: 削除…
ko: 삭제…
ru: Удалить...
uk: Видалити...
zh_hans: 删除…
zh_hk: 刪除…

# Deleting model '%@' from %@...
source: Deleting model '%1$@' from %2$@...
ar: جاري حذف النموذج '%1' من %2...
de: Lösche Modell '%1$@' von %2$@...
es: Eliminando el modelo '%1$@' de %2$@...
fr: Suppression du modèle '%1$@' de %2$@...
ja: モデル「%1$@」を「%2$@」から削除しています…
ko: %2에서 모델 '%1'을(를) 삭제하는 중…
ru: Удаление модели '%1' с %2...
uk: Видалення моделі '%1' з %2...
zh_hans: 正在从 %2$@ 删除模型“%1$@”…
zh_hk: 正在從 %2$@ 刪除模型「%1$@」…

source: Descending
ar: تنازلي
de: Absteigend
es: Descendente
fr: Décroissant
ja: 降順
ko: 내림차순
ru: По убыванию
uk: За спаданням
zh_hans: 降序
zh_hk: 降序

source: Details Information:
ar: معلومات مفصلة:
de: Detailinformationen:
es: Información Detallada:
fr: Informations détaillées :
ja: 詳細情報:
ko: 상세 정보:
ru: Подробная информация:
uk: Детальна інформація:
zh_hans: 详细信息：
zh_hk: 詳細資訊：

source: Developed with Generative AI
ar: تم التطوير باستخدام الذكاء الاصطناعي التوليدي
de: Mit generativer KI entwickelt
es: Desarrollado con IA Generativa
fr: Développé avec l'IA générative
ja: 生成AIと開発
ko: 생성형 AI로 개발됨
ru: Разработано с помощью ИИ
uk: Розроблено за допомогою ШІ
zh_hans: 使用生成式 AI 开发
zh_hk: 使用生成式 AI 開發

source: Digest:
ar: الملخص (Digest):
es: Resumen:
ja: ダイジェスト:
ko: 다이제스트:
ru: Дайджест:
uk: Дайджест:
zh_hans: 摘要：
zh_hk: 摘要：

source: Disconnected
ar: قطع الاتصال
de: Getrennt
es: Desconectado
fr: Déconnecté
ja: 未接続
ko: 연결 끊김
ru: Отключено
uk: Відключено
zh_hans: 未连接
zh_hk: 未連線

source: Donate at PayPal
ar: تبرع عبر PayPal
de: Spenden via PayPal
es: Donar en PayPal
fr: Faire un don sur PayPal
ja: PayPalで寄付
ko: PayPal로 후원
ru: Пожертвовать через PayPal
uk: Пожертвувати через PayPal
zh_hans: 通过 PayPal 捐赠
zh_hk: 透過 PayPal 捐助

source: Done
ar: تم
de: Fertig
es: Hecho
fr: Terminé
ja: 完了
ko: 완료
ru: Готово
uk: Готово
zh_hans: 完成
zh_hk: 完成

source: Download Failed
ar: فشل التنزيل
de: Download fehlgeschlagen
es: Descarga fallida
fr: Échec du téléchargement
ja: ダウンロードに失敗しました
ko: 다운로드 실패
ru: Загрузка не удалась
uk: Завантаження не вдалося
zh_hans: 下载失败
zh_hk: 下載失敗

source: Download Image
ar: تنزيل الصورة
de: Bild herunterladen
es: Descargar imagen
fr: Télécharger l'image
ja: 画像をダウンロード
ko: 이미지 다운로드
ru: Скачать изображение
uk: Завантажити зображення
zh_hans: 下载图像
zh_hk: 下載圖片

source: Download Progress: %@
ar: تقدم التحميل: %@
de: Download-Fortschritt: %@
es: Progreso de descarga: %@
fr: Progression du téléchargement : %@
ja: ダウンロード進捗: %@
ko: 다운로드 진행률: %@
ru: Прогресс завантаження: %@
uk: Прогрес завантаження: %@
zh_hans: 下载进度：%@
zh_hk: 下載進度：%@

# Downloading model '%@' from %@...
source: Downloading model '%1$@' from %2$@...
ar: جاري تنزيل النموذج '%1' من %2...
de: Lade Modell '%1$@' von %2$@ herunter...
es: Descargando modelo '%1$@' desde %2$@...
fr: Téléchargement du modèle '%1$@' depuis %2$@...
ja: モデル「%1$@」を「%2$@」からダウンロードしています…
ko: %2에서 모델 '%1'을(를) 다운로드하는 중…
ru: Загрузка модели '%1' с %2...
uk: Завантаження моделі '%1' з %2...
zh_hans: 正在从 %2$@ 下载模型“%1$@”…
zh_hk: 正在從 %2$@ 下載模型「%1$@」…

source: Drop here to add images
ar: قم بالسحب والإفلات هنا لإضافة الصور
de: Hier ablegen, um Bilder hinzuzufügen
es: Suelta aquí para añadir imágenes
fr: Déposez ici pour ajouter des images
ja: ここにドロップして画像を追加
ko: 여기에 드롭하여 이미지 추가
ru: Перетащите сюда, чтобы добавить изображения
uk: Перетягніть сюди, щоб додати зображення
zh_hans: 拖放到此处以添加图像
zh_hk: 拖放到此處以添加圖像

source: e.g., gemma3:4b, phi4:latest
ar: مثلاً: gemma3:4b, phi4:latest
de: z.B. gemma3:4b, phi4:latest
es: p. ej., gemma3:4b, phi4:latest
fr: ex: gemma3:4b, phi4:latest etc.
ja: 例: gemma3:4b、phi4:latestなど
ko: 예: gemma3:4b, phi4:latest 등
ru: например, gemma3:4b, phi4:latest
uk: наприклад, gemma3:4b, phi4:latest
zh_hans: 例如：gemma3:4b、phi4:latest 等
zh_hk: 例如：gemma3:4b、phi4:latest 等

source: e.g., localhost:11434 or 192.168.1.50:11434
ar: مثلاً: localhost:11434 أو 192.168.1.50:11434
de: z.B. localhost:11434 oder 192.168.1.50:11434
es: p. ej., localhost:11434 o 192.168.1.50:11434
fr: ex: localhost:11434 ou 192.168.1.50:11434 etc.
ja: 例: localhost:11434または192.168.1.50:11434など
ko: 예: localhost:11434 또는 192.168.1.50:11434 등
ru: например, localhost:11434 или 192.168.1.50:11434
uk: наприклад, localhost:11434 або 192.168.1.50:11434
zh_hans: 例如：localhost:11434 或 192.168.1.50:11434 等
zh_hk: 例如：localhost:11434 或 192.168.1.50:11434 等

source: e.g., Ollama Server
ar: مثلاً: خادم Ollama
de: z.B. Ollama Server
es: p. ej., Servidor Ollama
fr: ex: Serveur Ollama
ja: 例: Ollamaサーバー
ko: 예: Ollama 서버
ru: например, Сервер Ollama
uk: наприклад, Сервер Ollama
zh_hans: 例如：Ollama 服务器
zh_hk: 例如：Ollama 伺服器

source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
ru: Правка
uk: Редагувати
zh_hans: 编辑
zh_hk: 編輯

source: Edit Server
ar: تعديل الخادم
de: Server bearbeiten
es: Editar Servidor
fr: Modifier le serveur
ja: サーバーを編集
ko: 서버 편집
ru: Изменить сервер
uk: Змінити сервер
zh_hans: 编辑服务器
zh_hk: 編輯伺服器

source: Edit…
ar: تعديل…
de: Bearbeiten...
es: Editar…
fr: Modifier…
ja: 編集…
ko: 편집…
ru: Изменить...
uk: Змінити...
zh_hans: 编辑…
zh_hk: 編輯…

source: Embedding
ar: التضمين (Embedding)
de: Einbettung
es: Incrustación
fr: Intégration
ja: 埋め込み
ko: 임베딩
ru: Векторное представление
uk: Векторне представлення
zh_hans: 嵌入
zh_hk: 嵌入

source: Embedding Length:
ar: طول التضمين:
de: Einbettungslänge:
es: Longitud de Incrustación:
fr: Longueur d'intégration :
ja: 埋め込み長:
ko: 임베딩 길이:
ru: Длина эмбеддинга:
uk: Довжина ембеддингу:
zh_hans: 嵌入长度：
zh_hk: 嵌入長度：

source: Enable Custom Settings
ar: تمكين الإعدادات المخصصة
de: Benutzerdefinierte Einstellungen aktivieren
es: Habilitar Ajustes Personalizados
fr: Activer les paramètres personnalisés
ja: カスタム設定を有効にする
ko: 사용자 지정 설정 활성화
ru: Включить свои настройки
uk: Увімкнути свої налаштування
zh_hans: 启用自定义设置
zh_hk: 啟用自定義設定

source: Enables advanced options to adjust the model's behavior.
ar: تمكين الخيارات المتقدمة لضبط سلوك النموذج.
de: Aktiviert erweiterte Optionen zur Anpassung des Verhaltens des Modells.
es: Habilita opciones avanzadas para ajustar el comportamiento del modelo.
fr: Active les options avancées pour ajuster le comportement du modèle.
ja: モデルの動作を調整するための上級者オプションを有効化します。
ko: 모델의 동작을 조정하기 위한 고급 옵션을 활성화합니다.
ru: Включает расширенные параметры для настройки поведения модели.
uk: Вмикає розширені параметри для налаштування поведінки моделі.
zh_hans: 启用高级选项以调整模型的行为。
zh_hk: 啟用高級選項以調整模型的行為。

source: Enter a prompt…
ar: أدخل مطالبة...
de: Geben Sie einen Prompt ein…
es: Introduce un prompt…
fr: Saisissez un prompt…
ja: プロンプトを入力…
ko: 프롬프트를 입력하세요…
ru: Введите запрос...
uk: Введіть запит...
zh_hans: 输入提示词…
zh_hk: 輸入提示詞…

source: Enter custom height
ar: أدخل الارتفاع المخصص
de: Benutzerdefinierte Höhe eingeben
es: Introduce la altura personalizada
fr: Saisissez la hauteur personnalisée
ja: カスタム高さを入力
ko: 사용자 지정 높이 입력
ru: Введите высоту
uk: Введіть висоту
zh_hans: 输入自定义高度
zh_hk: 輸入自定義高度

source: Enter custom steps
ar: أدخل عدد الخطوات المخصصة
de: Benutzerdefinierte Schritte eingeben
es: Introduce los pasos personalizados
fr: Saisissez les étapes personnalisées
ja: カスタムステップ数を入力
ko: 사용자 지정 단계 입력
ru: Введите количество шагов
uk: Введіть кількість кроків
zh_hans: 输入自定义步数
zh_hk: 輸入自定義步數
